Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A programmer assertion that the body of the annotated method or constructor does not perform potentially unsafe operations on its varargs parameter.
zh_cn: 程序员断言注解的方法或构造函数体不对其可变参数参数来执行潜在的不安全操作。

source: A proxy class extends java.lang.reflect.Proxy.
zh_cn: 代理类扩展 java.lang.reflect.Proxy。

source: A proxy class has the following properties:
zh_cn: 代理类具用以下属性：

source: A proxy class implements exactly the interfaces specified at its creation, in the same order.
zh_cn: 代理类会按同一顺序准确地实现其创建时指定的接口。

source: A proxy instance has the following properties:
zh_cn: 代理实例具有以下属性：

source: A public key.
zh_cn: 公钥。

source: A random number generator isolated to the current thread.
zh_cn: 与当前线程隔离的随机数生成器。

source: A recursive result-bearing ForkJoinTask.
zh_cn: 递归结果承载 ForkJoinTask。

source: A recursive resultless ForkJoinTask.
zh_cn: 递归无结果的 ForkJoinTask。

source: A reentrant mutual exclusion Lock with the same basic behavior and semantics as the implicit monitor lock accessed using synchronized methods and statements, but with extended capabilities.
zh_cn: 一个可重入的互斥锁 Lock，它具有与使用 synchronized 方法和语句所访问的隐式监视器锁相同的一些基本行为和语义，但功能更强大。

source: A reflection-based utility that enables atomic updates to designated volatile int fields of designated classes.
zh_cn: 基于反射的实用工具，可以对指定类的指定 volatile int 字段进行原子更新。

source: A reflection-based utility that enables atomic updates to designated volatile long fields of designated classes.
zh_cn: 基于反射的实用工具，可以对指定类的指定 volatile long 字段进行原子更新。

source: A reflection-based utility that enables atomic updates to designated volatile reference fields of designated classes.
zh_cn: 基于反射的实用工具，可以对指定类的指定 volatile 字段进行原子更新。

source: A resource that must be closed when it is no longer needed.
zh_cn: 不再需要时必须关闭的资源。

source: A return value of null does not necessarily indicate that the map contains no mapping for the key; it's also possible that the map explicitly maps the key to null.
zh_cn: 返回 null 值并不一定 表明该映射不包含该键的映射关系；也可能该映射将该键显示地映射为 null。

source: A reusable synchronization barrier, similar in functionality to CyclicBarrier and CountDownLatch but supporting more flexible usage.
zh_cn: 可重复使用的屏障同步，在功能上类似于 CyclicBarrier 和 CountDownLatch 但支撑更灵活的使用。

source: A runtime exception for Provider exceptions (such as misconfiguration errors or unrecoverable internal errors), which may be subclassed by Providers to throw specialized, provider-specific runtime errors.
zh_cn: 用于 Provider 异常(例如误配置错误或不可恢复的内部错误）的运行时异常，Provider 可以为它创建子类以抛出特殊的、特定于 provider 的运行时错误。

source: A sample implementation is:
zh_cn: 示例实现如下：

source: A scalable concurrent ConcurrentNavigableMap implementation.
zh_cn: 可缩放的并发 ConcurrentNavigableMap 实现。

source: A scalable concurrent NavigableSet implementation based on a ConcurrentSkipListMap.
zh_cn: 一个基于 ConcurrentSkipListMap 的可缩放并发 NavigableSet 实现。

source: A second reason that a throwable may have a cause is that the method that throws it must conform to a general-purpose interface that does not permit the method to throw the cause directly.
zh_cn: 导致 throwable cause 的另一个 cause 是，抛出它的方法必须符合通用接口，而通用接口不允许方法直接抛出 cause。

source: A service that decouples the production of new asynchronous tasks from the consumption of the results of completed tasks.
zh_cn: 将生产新的异步任务与使用已完成任务的结果分离开来的服务。

source: A short buffer.
zh_cn: short 缓冲区。

source: A simple interface which provides a mechanism to map between a file name and a MIME type string.
zh_cn: 提供在文件名和 MIME 类型字符串之间进行映射的机制的简单接口。

source: A simple service-provider loading facility.
zh_cn: 一个简单的服务提供者加载设施。

source: A simple text scanner which can parse primitive types and strings using regular expressions.
zh_cn: 一个可以使用正则表达式来解析基本类型和字符串的简单文本扫描器。

source: A small toolkit of classes that support lock-free thread-safe programming on single variables.
zh_cn: 类的小工具包，支持在单个变量上解除锁的线程安全编程。

source: A socket option associated with a socket.
zh_cn: 与套接字关联的套接字选项。

source: A specialized Map implementation for use with enum type keys.
zh_cn: 与枚举类型键一起使用的专用 Map 实现。

source: A specialized Set implementation for use with enum types.
zh_cn: 与枚举类型一起使用的专用 Set 实现。

source: A stage of a possibly asynchronous computation, that performs an action or computes a value when another CompletionStage completes.
zh_cn: 可能是异步计算的一个阶段，在另一个 completionstage 完成时执行操作或计算值。

source: A state object for collecting statistics such as count, min, max, sum, and average.
zh_cn: 一个状态对象，用于收集统计信息，如计数、最小值、最大值、总和和平均值。

source: A string buffer is like a String, but can be modified.
zh_cn: 一个类似于 String 的字符串缓冲区，但不能修改。

source: A subclass overrides the finalize method to dispose of system resources or to perform other cleanup.
zh_cn: 子类重写 finalize 方法，以配置系统资源或执行其他清除。

source: A synchronization aid that allows a set of threads to all wait for each other to reach a common barrier point.
zh_cn: 一个同步辅助类，它允许一组线程互相等待，直到到达某个公共屏障点 (common barrier point)。

source: A synchronization aid that allows one or more threads to wait until a set of operations being performed in other threads completes.
zh_cn: 一个同步辅助类，在完成一组正在其他线程中执行的操作之前，它允许一个或多个线程一直等待。

source: A synchronization point at which threads can pair and swap elements within pairs.
zh_cn: 可以在对中对元素进行配对和交换的线程的同步点。

source: A synchronizer that may be exclusively owned by a thread.
zh_cn: 可以由线程以独占方式拥有的同步器。

source: A system may not allow modifications to environment variables or may forbid certain variable names or values.
zh_cn: 系统可能不允许修改环境变量或禁止某些变量名或变量值。

source: A tactic that often works well is to examine a reference queue in the course of performing some other fairly-frequent action.
zh_cn: 一种通常很有用的策略是：在执行另一个相当频繁的操作期间检查引用队列。

source: A tagging interface that all event listener interfaces must extend.
zh_cn: 所有事件侦听器接口必须扩展的标记接口。

source: A task that can be scheduled for one-time or repeated execution by a Timer.
zh_cn: 由 Timer 安排为一次执行或重复执行的任务。

source: A task that returns a result and may throw an exception.
zh_cn: 返回结果并且可能抛出异常的任务。

source: A thread becomes the owner of the object's monitor in one of three ways:
zh_cn: 通过以下三种方法之一，线程可以成为此对象监视器的所有者：

source: A thread can also wake up without being notified, interrupted, or timing out, a so-called spurious wakeup.
zh_cn: 在没有被通知、中断或超时的情况下，线程还可以唤醒一个所谓的虚假唤醒 (spurious wakeup)。

source: A thread can be in one of the following states:
zh_cn: 线程可以处于下列状态之一：

source: A thread can be in only one state at a given point in time.
zh_cn: 在给定时间点上，一个线程只能处于一种状态。

source: A thread executing in the Java virtual machine is in this state.
zh_cn: 正在 Java 虚拟机中执行的线程处于这种状态。

source: A thread group represents a set of threads.
zh_cn: 线程组表示一个线程的集合。

source: A thread in the blocked state is waiting for a monitor lock to enter a synchronized block/method or reenter a synchronized block/method after calling Object.wait.
zh_cn: 处于受阻塞状态的某一线程正在等待监视器锁，以便进入一个同步的块/方法，或者在调用 Object.wait 之后再次进入同步的块/方法。

source: A thread in the runnable state is executing in the Java virtual machine but it may be waiting for other resources from the operating system such as processor.
zh_cn: 处于可运行状态的某一线程正在 Java 虚拟机中运行，但它可能正在等待操作系统中的其他资源，比如处理器。

source: A thread in the waiting state is waiting for another thread to perform a particular action.
zh_cn: 处于等待状态的线程正等待另一个线程，以执行特定操作。

source: A thread interruption ignored because a thread was not alive at the time of the interrupt will be reflected by this method returning false.
zh_cn: 线程中断被忽略，因为在中断时不处于活动状态的线程将由此返回 false 的方法反映出来。

source: A thread is alive if it has been started and has not yet died.
zh_cn: 如果线程已经启动且尚未终止，则为活动状态。

source: A thread is allowed to access information about its own thread group, but not to access information about its thread group's parent thread group or any other thread groups.
zh_cn: 允许线程访问有关自己的线程组的信息，但是不允许它访问有关其线程组的父线程组或其他任何线程组的信息。

source: A thread is in the timed waiting state due to calling one of the following methods with a specified positive waiting time:
zh_cn: 某一线程因为调用以下带有指定正等待时间的方法之一而处于定时等待状态：

source: A thread is in the waiting state due to calling one of the following methods:
zh_cn: 某一线程因为调用下列方法之一而处于等待状态：

source: A thread managed by a ForkJoinPool, which executes ForkJoinTasks.
zh_cn: 由 ForkJoinPool 管理的线程，它执行 ForkJoinTask。

source: A thread state.
zh_cn: 线程状态。

source: A thread that has called Thread.join() is waiting for a specified thread to terminate.
zh_cn: 已经调用了 Thread.join() 的线程正在等待指定线程终止。

source: A thread that has exited is in this state.
zh_cn: 已退出的线程处于这种状态。

source: A thread that has not yet started is in this state.
zh_cn: 至今尚未启动的线程处于这种状态。

source: A thread that is blocked waiting for a monitor lock is in this state.
zh_cn: 受阻塞并等待某个监视器锁的线程处于这种状态。

source: A thread that is waiting for another thread to perform an action for up to a specified waiting time is in this state.
zh_cn: 等待另一个线程来执行取决于指定等待时间的操作的线程处于这种状态。

source: A thread that is waiting indefinitely for another thread to perform a particular action is in this state.
zh_cn: 无限期地等待另一个线程来执行某一特定操作的线程处于这种状态。

source: A thread waits on an object's monitor by calling one of the wait methods.
zh_cn: 线程通过调用其中一个 wait 方法，在对象的监视器上等待。

source: A thread's id is assigned the first time it invokes ThreadId.get() and remains unchanged on subsequent calls.
zh_cn: 线程 ID 是在第一次调用 ThreadId.get() 时分配的，在后续调用中不会更改。

source: A thread-safe random-access list.
zh_cn: 线程安全的随机访问列表。

source: A thread-safe, mutable sequence of characters.
zh_cn: 线程安全的可变字符序列。

source: A throwable contains a snapshot of the execution stack of its thread at the time it was created.
zh_cn: Throwable 包含了其线程创建时线程执行堆栈的快照。

source: A timeout of 0 means to wait forever.
zh_cn: 超时为 0 意味着要一直等下去。

source: A transparent stream that updates the associated message digest using the bits going through the stream.
zh_cn: GuardedObject 是一个用来保护对另一个对象的访问的对象。

source: A type variable is created the first time it is needed by a reflective method, as specified in this package.
zh_cn: 类型变量在反射方法首次需要时创建（在此包中指定）。

source: A typesafe enumeration for byte orders.
zh_cn: 字节顺序的类型安全枚举。

source: A typical strategy is to transform the name into a file name and then read a "class file" of that name from a file system.
zh_cn: 一般策略是将名称转换为某个文件名，然后从文件系统读取该名称的“类文件”。

source: A value of true indicates that the reflected object should suppress Java language access checking when it is used.
zh_cn: 值为 true 则指示反射的对象在使用时应该取消 Java 语言访问检查。

source: A value of false indicates that the reflected object should enforce Java language access checks.
zh_cn: 值为 false 则指示反射的对象应该实施 Java 语言访问检查。

source: A version of AbstractQueuedSynchronizer in which synchronization state is maintained as a long.
zh_cn: 以 long 形式维护同步状态的一个 AbstractQueuedSynchronizer 版本。

source: A view of a ConcurrentHashMap as a Set of keys, in which additions may optionally be enabled by mapping to a common value.
zh_cn: 一个的 ConcurrentHashMap 的视图，作为键的 Set，其中添加可任选地被映射被使能以一个共同的值。

source: A write to a volatile field happens-before every subsequent read of that same field.
zh_cn: 写入 volatile 字段 happen-before 每个后续读取相同字段。

source: About IPv6
zh_cn: 关于 IPv6

source: Abstract base class for reference objects.
zh_cn: 引用对象的抽象基类。

source: Abstract base class for tasks that run within a ForkJoinPool.
zh_cn: 在 ForkJoinPool 中运行的任务的抽象基类。

source: Abstract class for reading character streams.
zh_cn: 用于读取字符流的抽象类。

source: Abstract class for reading filtered character streams.
zh_cn: 用于读取已过滤的字符流的抽象类。

source: Abstract class for writing filtered character streams.
zh_cn: 用于写入已过滤的字符流的抽象类。

source: Abstract class for writing to character streams.
zh_cn: 写入字符流的抽象类。

source: Abstract datagram and multicast socket implementation base class.
zh_cn: 数据报和多播套接字实现的抽象基类。

source: Access to the program file was denied.
zh_cn: 对程序文件的访问被拒绝。

source: Accessing or modifying the field of a null object.
zh_cn: 访问或修改 null 对象的字段。

source: Accessing or modifying the slots of null as if it were an array.
zh_cn: 将 null 作为一个数组，访问或修改其时间片。

source: Accuracy of the floating-point Math methods is measured in terms of ulps, units in the last place.
zh_cn: 浮点 Math 方法的准确性根据 ulp（units in the last place，最后一位的进退位）来衡量。

source: Actions in a thread prior to placing an object into any concurrent collection happen-before actions subsequent to the access or removal of that element from the collection in another thread.
zh_cn: 线程中将一个对象放入任何并发 collection 之前的操作 happen-before 从另一线程中的 collection 访问或移除该元素的后续操作。

source: Actions in a thread prior to the submission of a Runnable to an Executor happen-before its execution begins.
zh_cn: 线程中向 Executor 提交 Runnable 之前的操作 happen-before 其执行开始。

source: Actions prior to "releasing" synchronizer methods such as Lock.unlock, Semaphore.release, and CountDownLatch.countDown happen-before actions subsequent to a successful "acquiring" method such as Lock.lock, Semaphore.acquire, Condition.await, and CountDownLatch.await on the same synchronizer object in another thread.
zh_cn: “释放”同步储存方法（如 Lock.unlock、Semaphore.release 和 CountDownLatch.countDown）之前的操作 happen-before 另一线程中相同同步储存对象成功“获取”方法（如 Lock.lock、Semaphore.acquire、Condition.await 和 CountDownLatch.await）的后续操作。

source: Actions prior to calling CyclicBarrier.await and Phaser.awaitAdvance (as well as its variants) happen-before actions performed by the barrier action, and actions performed by the barrier action happen-before actions subsequent to a successful return from the corresponding await in other threads.
zh_cn: 调用 CyclicBarrier.await 和 Phaser.awaitAdvance(以及其变体)之前的操作 happen-before 屏障操作所执行的操作，屏障操作所执行的操作 happen-before 从另一线程中对应 await 成功返回的后续操作。

source: Actions taken by the asynchronous computation represented by a Future happen-before actions subsequent to the retrieval of the result via Future.get() in another thread.
zh_cn: 异步计算（由 Future 表示）所采取的操作 happen-before 通过另一线程中 Future.get() 获取结果后续的操作。

source: Additional Specification
zh_cn: 其他规格

source: Additionally weakCompareAndSet does not provide ordering guarantees that are usually needed for synchronization control.
zh_cn: 此外，weakCompareAndSet 不提供通常需要同步控制的排序保证。

source: Additionally, classes are provided only for those types that are commonly useful in intended applications.
zh_cn: 另外，仅为那些通常在预期应用程序中使用的类型提供类。

source: Additionally, if the table array has not been allocated, this
zh_cn: 此外，如果表格数组尚未分配，

source: Additionally, method terminated() can be overridden to perform any special processing that needs to be done once the Executor has fully terminated.
zh_cn: 此外，还可以重写方法 terminated() 来执行 Executor 完全终止后需要完成的所有特殊处理。

source: Addresses
zh_cn: 地址

source: Addresses are used throughout the java.net APIs as either host identifiers, or socket endpoint identifiers.
zh_cn: 在整个 java.net API 中，地址或者用作主机标识符或者用作套接字端点标识符。

source: Adds this reference object to the queue with which it is registered, if any.
zh_cn: 将此引用对象添加到引用对象已向其注册的队列（如果有）。

source: Adds two double values together as per the + operator.
zh_cn: 按 + 运算符将两个 double 值相加。

source: Adds two float values together as per the + operator.
zh_cn: 按 + 运算符将两个 float 值相加。

source: Adds two long values together as per the + operator.
zh_cn: 按 + 运算符将两个 long 值相加。

source: Adds two integers together as per the + operator.
zh_cn: 按 + 运算符将两个整数相加。

source: After the finalize method has been invoked for an object, no further action is taken until the Java virtual machine has again determined that there is no longer any means by which this object can be accessed by any thread that has not yet died, including possible actions by other objects or classes which are ready to be finalized, at which point the object may be discarded.
zh_cn: 在启用某个对象的 finalize 方法后，将不会执行进一步操作，直到 Java 虚拟机再次确定尚未终止的任何线程无法再通过任何方法访问此对象，其中包括由准备终止的其他对象或类执行的可能操作，在执行该操作时，对象可能被丢弃。

source: All actions in a thread happen-before any other thread successfully returns from a join on that thread.
zh_cn: 线程中的所有操作 happen-before 从该线程上的 join 成功返回的任何其他线程。

source: All annotations directly present on this element
zh_cn: 直接存在于此元素上的所有注释

source: All annotations returned by methods in this interface are immutable and serializable.
zh_cn: 由此接口中的方法返回的所有注释都是不可变并且可序列化的。

source: All applicable internal methods accept a hash code as an argument (as normally supplied from a public method), allowing them to call each other without recomputing user hashCodes.
zh_cn: 所有适用的内部方法都接受散列码作为参数（通常由公共方法提供），允许它们互相调用而不用重新计算 hash。

source: All its standard I/O (i.e. stdin, stdout, stderr) operations will be redirected to the parent process, where they can be accessed via the streams obtained using the methods getOutputStream(), getInputStream(), and getErrorStream().
zh_cn: 它的所有标准 I/O（即 stdin、stdout 和 stderr）操作都将通过三个流 (getOutputStream()、getInputStream() 和 getErrorStream()) 重定向到父进程。

source: All methods that accept timeout parameters treat values less than or equal to zero to mean not to wait at all.
zh_cn: 接受超时期参数的所有方法将小于等于 0 的值视为根本不会等待。

source: All non-public interfaces must be in the same package; otherwise, it would not be possible for the proxy class to implement all of the interfaces, regardless of what package it is defined in.
zh_cn: 所有非公共接口必须位于同一包中；否则，该代理类将不可能实现所有的接口，无论它在哪一个包中定义。

source: All objects, including arrays, implement the methods of this class.
zh_cn: 所有对象（包括数组）都实现这个类的方法。

source: All of the Class objects in the interfaces array must represent interfaces, not classes or primitive types.
zh_cn: interfaces 数组中的所有 Class 对象必须表示接口，而不能表示类或基本类型。

source: All of the interface types must be visible by name through the specified class loader.
zh_cn: 所有接口类型的名称通过特定的类加载器必须可见。

source: All soft references to softly-reachable objects are guaranteed to have been cleared before the virtual machine throws an OutOfMemoryError.
zh_cn: 软可到达对象的所有软引用都要保证在虚拟机抛出 OutOfMemoryError 之前已经被清除。

source: All stack frames except for the one at the top of the stack represent a method invocation.
zh_cn: 所有的堆栈帧（堆栈顶部的那个堆栈帧除外）都表示一个方法调用。

source: All string literals in Java programs, such as "abc", are implemented as instances of this class.
zh_cn: Java 程序中的所有字符串字面值（如 "abc" ）都作为此类的实例实现。

source: All the constants of an enum type can be obtained by calling the implicit public static T[] values() method of that type.
zh_cn: 枚举类型的所有的常数可以通过调用隐含 public static T[] values() 该类型的方法来获得。

source: All threads that are not daemon threads have died, either by returning from the call to the run method or by throwing an exception that propagates beyond the run method.
zh_cn: 非守护线程的所有线程都已停止运行，无论是通过从对 run 方法的调用中返回，还是通过抛出一个传播到 run 方法之外的异常。

source: Allocates a Boolean object representing the value argument.
zh_cn: 分配一个表示 value 参数的 Boolean 对象。

source: Allocates a Boolean object representing the value true if the string argument is not null and is equal, ignoring case, to the string "true".
zh_cn: 如果 String 参数不为 null 且在忽略大小写时等于 "true"，则分配一个表示 true 值的 Boolean 对象。

source: Allocates a new String so that it represents the sequence of characters currently contained in the character array argument.
zh_cn: 分配一个新的 String，使其表示字符数组参数中当前包含的字符序列。

source: Allocates a new String that contains characters from a subarray of the Unicode code point array argument.
zh_cn: 分配一个新的 String，它包含 Unicode 代码点 数组参数一个子数组的字符。

source: Allocates a new String that contains characters from a subarray of the character array argument.
zh_cn: 分配一个新的 String，它包含取自字符数组参数一个子数组的字符。

source: Allocates a new Thread object so that it has target as its run object, has the specified name as its name, and belongs to the thread group referred to by group, and has the specified stack size.
zh_cn: 分配新的 Thread 对象，以便将 target 作为其运行对象，将指定的 name 作为其名称，作为 group 所引用的线程组的一员，并具有指定的堆栈大小。

source: Allocates a new Thread object so that it has target as its run object, has the specified name as its name, and belongs to the thread group referred to by group.
zh_cn: 分配新的 Thread 对象，以便将 target 作为其运行对象，将指定的 name 作为其名称，并作为 group 所引用的线程组的一员。

source: Allocates a new Thread object.
zh_cn: 分配新的 Thread 对象。

source: Allocates a new string that contains the sequence of characters currently contained in the string buffer argument.
zh_cn: 分配一个新的字符串，它包含字符串缓冲区参数中当前包含的字符序列。

source: Allocates a new string that contains the sequence of characters currently contained in the string builder argument.
zh_cn: 分配一个新的字符串，它包含字符串生成器参数中当前包含的字符序列。

source: Also note that this interface does not itself define an annotation type.
zh_cn: 还要注意此接口本身不定义 annotation 类型。

source: Although the JDBCTM API is mainly geared to passing SQL statements to a database, it provides for reading and writing data from any data source with a tabular format.
zh_cn: 虽然 JDBCTM API 主要用于将 SQL 语句传递给数据库，但它还可以用于以表格方式从任何数据源中读写数据。

source: Always returns null in Android
zh_cn: Android 中总是返回 null

source: Among other usage contexts, lazySet may apply when nulling out, for the sake of garbage collection, a reference that is never accessed again.
zh_cn: 在其他使用上下文中，当为 null 时（为了垃圾回收），lazySet 可以应用不会再次访问的引用。

source: Among the facilities provided by the System class are standard input, standard output, and error output streams; access to externally defined properties and environment variables; a means of loading files and libraries; and a utility method for quickly copying a portion of an array.
zh_cn: 在 System 类提供的设施中，有标准输入、标准输出和错误输出流；对外部定义的属性和环境变量的访问；加载文件和库的方法；还有快速复制数组的一部分的实用方法。

source: Among the many things that can go wrong are:
zh_cn: 其中有很多方面会导致错误有：

source: An Exchanger allows two threads to exchange objects at a rendezvous point, and is useful in several pipeline designs.
zh_cn: Exchanger 允许两个线程在 collection 点交换对象，它在多流水线设计中是有用的。

source: An Executor that provides methods to manage termination and methods that can produce a Future for tracking progress of one or more asynchronous tasks.
zh_cn: Executor 提供了管理终止的方法，以及可为跟踪一个或多个异步任务执行状况而生成 Future 的方法。

source: An ExecutorService for running ForkJoinTasks.
zh_cn: 用于运行 ForkJoinTask 的 ExecutorService。

source: An ExecutorService that can schedule commands to run after a given delay, or to execute periodically.
zh_cn: 一个 ExecutorService，可安排在给定的延迟后运行或定期执行的命令。

source: An ExecutorService that executes each submitted task using one of possibly several pooled threads, normally configured using Executors factory methods.
zh_cn: 一个 ExecutorService，它使用可能的几个池线程之一执行每个提交的任务，通常使用 Executors 工厂方法配置。

source: An AtomicMarkableReference maintains an object reference along with a mark bit, that can be updated atomically.
zh_cn: AtomicMarkableReference 维护带有标记位的对象引用，可以原子方式对其进行更新。

source: An AtomicStampedReference maintains an object reference along with an integer "stamp", that can be updated atomically.
zh_cn: AtomicStampedReference 维护带有整数“标志”的对象引用，可以用原子方式对其进行更新。

source: An AttributedCharacterIterator allows iteration through both text and related attribute information.
zh_cn: AttributedCharacterIterator 允许对文本和相关属性信息的迭代。

source: An Error is a subclass of Throwable that indicates serious problems that a reasonable application should not try to catch.
zh_cn: Error 是 Throwable 的子类，用于指示合理的应用程序不应该试图捕获的严重问题。

source: An UndeclaredThrowableException instance contains the undeclared checked exception that was thrown by the invocation handler, and it can be retrieved with the getUndeclaredThrowable() method.
zh_cn: UndeclaredThrowableException 实例包含由调用处理程序抛出的经过检查的未声明异常，而且可以使用 getUndeclaredThrowable() 方法获取。

source: An int array in which elements may be updated atomically.
zh_cn: 可以用原子方式更新其元素的 int 数组。

source: An int value that may be updated atomically.
zh_cn: 可以用原子方式更新的 int 值。

source: An int value represents all Unicode code points, including supplementary code points.
zh_cn: int 值表示所有 Unicode 代码点，包括增补代码点。

source: An Annotation object is used as a wrapper for a text attribute value if the attribute has annotation characteristics.
zh_cn: 如果文本属性具有 annotation 特征，则 Annotation 对象用作文本属性值的包装器。

source: An AttributedString holds text and related attribute information.
zh_cn: AttributedString 保存文本及相关属性信息。

source: An Entry maintaining a key and a value.
zh_cn: 维护键和值的 Entry。

source: An Entry maintaining an immutable key and value.
zh_cn: 维护不可变的键和值的 Entry。
